# Exercício 02 – Manipulando dados com Pandas
#### a) Crie um programa em pandas para ler o arquivo em Excel imobiliária.xlsx
#### b) e coloque em um dataframe.
#### c) Visualize o cabeçalho dos dados;
#### d) Visualize as últimas linhas;
#### e) Escreva um programa para renomear o cabeçalho da tabela com os
#### f) seguintes nomes:

In [4]:
#A) importando arquivo
#B) Colocando em dataframe
#C) Visualizando o cabeçalho

import pandas as pd

caminho = "C:\\\\Users\\\\FIC\\\\Documents\\\\gabrielly_holanda_big_data\\\\Arquivos\\\\Imobiliária.xlsx"

df= pd.read_excel(caminho)

df.head(2)

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5

In [5]:
#D) Visualizando o as últimas linhas
df.tail(2)

,Coluna 1,Coluna 2,Coluna 3,Coluna 4,Coluna 5,Coluna 6,Coluna 7,Coluna 8,Coluna 8.1,Coluna 10
1115,Leste,Simone,2011-03-27,Apartamento,42.0,1,1,Sim,167900,2518.5
1116,Oeste,Simone,2011-03-28,Apartamento,100.5,2,2,Sim,227600,3414.0

In [6]:
#E) Renomeando nome das colunas 

df.columns =[
    'Filial','Vendedor','Data','Tipo','Área (m²)','Dorms.','Garag.','Piscina','Preco','Comissao']

df.head()

,Filial,Vendedor,Data,Tipo,Área (m²),Dorms.,Garag.,Piscina,Preco,Comissao
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5
4,Noroeste,Cristina,2005-10-16,Apartamento,93.0,2,2,Sim,235400,3531.0

In [7]:
#Outra forma:

headers=[
    'Filial','Vendedor','Data','Tipo','Área (m²)','Dorms.','Garag.','Piscina','Preco','Comissao']

df.columns= (headers)
df.head()

,Filial,Vendedor,Data,Tipo,Área (m²),Dorms.,Garag.,Piscina,Preco,Comissao
0,Centro,Simone,2005-10-08,Apartamento,102.5,2,2,Sim,235500,3532.5
1,Noroeste,Simone,2005-10-08,Apartamento,199.5,4,4,Não,377700,5665.5
2,Norte,Roberto,2005-10-12,Casa,145.5,2,2,Não,232500,3487.5
3,Sudeste,Simone,2005-10-14,Apartamento,153.5,3,2,Não,289100,4336.5
4,Noroeste,Cristina,2005-10-16,Apartamento,93.0,2,2,Sim,235400,3531.0

In [8]:
# G) Tipos de dados 
# H) Valores faltantes ou nulos
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1117 entries, 0 to 1116
Data columns (total 10 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Filial     1117 non-null   object
 1   Vendedor   1117 non-null   object
 2   Data       1117 non-null   datetime64[ns]
 3   Tipo       1117 non-null   object
 4   Área (m²)  1117 non-null   float64
 5   Dorms.     1117 non-null   int64
 6   Garag.     1117 non-null   int64
 7   Piscina    1117 non-null   object
 8   Preco      1117 non-null   int64
 9   Comissao   1117 non-null   float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(4)
memory usage: 87.4+ KB

In [20]:
#H) modo, média, máximo, mínimo e contagem da coluna PREÇO

#SOMA
df['Preco'].sum ()

295035000

In [21]:
df['Preco'].mean()

264131.6025067144

In [22]:
df['Preco'].max()

384300

In [23]:
df['Preco'].min()

145100

In [24]:
df['Preco'].count()

1117

#### 8. Crie um programa para criar um dataframe para mostrar as vendas por região, e salvar um arquivo em Excel para cada região.

In [38]:
#Gerar um relatório de vendas da região CENTRO
# Filtrar os dados
df_final= df[df['Filial'] == 'Centro']

#Mapear o caminho final e definir um nome para o arquivo
caminho1= 'C:\\Users\\FIC\\Documents\\gabrielly_holanda_big_data\\Relatórios Filiais\\'
arquivo= 'centro.xlsx'

df_final.to_excel(caminho1 + arquivo)